# coding: utf-8

"""
    Realtime money flow.
"""

import requests

index_url = 'http://s1.dfcfw.com/js/zs000001.js?rt=0.20552931982704514'
stock_url = 'http://s1.dfcfw.com/js/000001.js?rt=0.17464548470180996'


def fetch_realtime_money_flow(code):
    data = [
        -1983.40,   # 主力净流入(万）
        -8.03,      # 主力净比 (%)
        -446.06,    # 超大单净流入
        -1.81,      # 超大单净比
        -1537.34,   # 大单净流入
        -6.22,      # 大单净比
        668.12,     # 中单净流入
        2.70,       # 中单净比
        1315.28,    # 小单净流入
        5.32,       # 小单净比
        0.00,       # ?
        0.00,       # ?
        1332.64,    # 超大单流入
        -1778.71,   # 超大单流出
        7209.15,    # 大单流入
        -8746.49,   # 大单流出
        8989.29,    # 中单流入
        -8321.17,   # 中单流出
        7144.82,    # 小单流入
        -5829.54,   # 小单流出
        23343.26,   # ?
        -22897.20   # ?
    ]

